app/controllers/beers_controller.rb

  def index
    @beers = Beer.all
---
SELECT "beers".* FROM "beers"

  def create
    @beer = Beer.new(beer_params)
    @ingredients = @beer.ingredients
    if @beer.save
      @ingredients.each {|i| i.save }
---
INSERT INTO "beers" ("name", "description", "abv", "ibu", "volume", "boil_volume", "mash_instruct", "fermentation_instruct", "tips") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["name", "qasadf"], ["description", "asdfasdf"], ["abv", 0.2], ["ibu", 0.2], ["volume", 0.2], ["boil_volume", 0], ["mash_instruct", "asdf"], ["fermentation_instruct", "asf"], ["tips", "asdf"]]
INSERT INTO "ingredients" ("name", "category", "amount", "unit", "beer_id") VALUES (?, ?, ?, ?, ?)  [["name", "ing1 name"], ["category", "ing1 cat"], ["amount", 1111.0], ["unit", "ing1unit"], ["beer_id", 140]]
INSERT INTO "beers" ("name", "description", "mash_instruct", "fermentation_instruct", "food_pairing", "tips") VALUES (?, ?, ?, ?, ?, ?)  [["name", "bs beer to delete"], ["description", ""], ["mash_instruct", ""], ["fermentation_instruct", ""], ["food_pairing", ""], ["tips", ""]]
INSERT INTO "ingredients" ("name", "category", "amount", "unit", "beer_id") VALUES (?, ?, ?, ?, ?)  [["name", "aadsf"], ["category", "sd"], ["amount", 32.0], ["unit", "ad"], ["beer_id", 175]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."beer_id" = ?  [["beer_id", 36]]

  def destroy
   if @beer.destroy
---
DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 163]]

    def set_beer
      @beer = Beer.find(params[:id])
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 36], ["LIMIT", 1]]