app/controllers/beers_controller.rb

DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 69]]
---
  def destroy
    @beer.destroy